DELETE
FROM user_roles;
DELETE
FROM meals;
DELETE
FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin');

INSERT INTO user_roles (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);

INSERT INTO meals (user_id, date_time, description, calories)
VALUES (100000, '2020-01-30 10:00:00', 'Завтрак', 500),
       (100000, '2020-01-30 13:00:00', 'Обед', 1000),
       (100000, '2020-01-30 20:00:00', 'Ужин', 500),
       (100000, '2020-02-01 09:00:00', 'Завтрак', 500),
       (100000, '2020-02-01 13:30:00', 'Обед', 1500),
       (100000, '2020-02-01 19:00:00', 'Ужин', 800),
       (100001, '2020-01-31 00:00:00', 'Время на граничное значение', 100),
       (100001, '2020-01-31 10:00:00', 'Завтрак', 1000),
       (100001, '2020-01-31 13:00:00', 'Обед', 500),
       (100001, '2020-01-31 20:00:00', 'Ужин', 410),
       (100001, '2020-02-02 00:00:00', 'Время на граничное значение', 100),
       (100001, '2020-02-02 10:15:00', 'Завтрак', 1000),
       (100001, '2020-02-02 13:30:00', 'Обед', 500),
       (100001, '2020-02-02 20:20:00', 'Ужин', 400),
       (100001, '2020-02-04 00:00:00', 'Время на граничное значение', 100),
       (100001, '2020-02-04 10:45:00', 'Завтрак', 600),
       (100001, '2020-02-04 13:20:00', 'Обед', 1500),
       (100001, '2020-02-04 20:50:00', 'Ужин', 400),
       (100001, '2020-02-06 00:00:00', 'Время на граничное значение', 100),
       (100001, '2020-02-06 09:45:00', 'Завтрак', 500),
       (100001, '2020-02-06 12:20:00', 'Обед', 1200),
       (100001, '2020-02-06 19:50:00', 'Ужин', 200);



